import React, { FC } from 'react'

export const PrivacyPolicy: FC<{}> = () => {
  return (
    <>
      <h2>プライバシーポリシー</h2>
      <p>
        岩本海童（サイトの運営者。以下「私」といいます。）は、私の提供するサービス（以下「本サービス」といいます。）における、ユーザーについての個人情報を含む利用者情報の取扱いについて、以下のとおりプライバシーポリシー（以下「本ポリシー」といいます。）を定めます。
      </p>
      <h3>1. 収集する利用者情報及び収集方法</h3>
      <p>
        本ポリシーにおいて、「利用者情報」とは、ユーザーの識別に係る情報、通信サービス上の行動履歴、その他ユーザーのスマートフォン、PC等の端末においてユーザーまたはユーザーの端末に関連して生成または蓄積された情報であって、本ポリシーに基づき私が収集するものを意味するものとします。
        本サービスにおいて私が収集する利用者情報は、その収集方法に応じて、以下のようなものとなります。
      </p>
      <h4>(1) ユーザーからご提供いただく情報</h4>
      <p>ユーザーが本サービスを利用するために、ご提供いただく情報は以下のとおりです。</p>
      <ul>
        <li>メールアドレス</li>
        <li>その他私が定める入力フォームにユーザーが入力する情報</li>
      </ul>
      <h4>
        (2)
        ユーザーが本サービスの利用において、他のサービスと連携を許可することにより、当該他のサービスからご提供いただく情報
      </h4>
      <p>
        ユーザーが、本サービスを利用するにあたり、ソーシャルネットワークサービス等の外部サービスとの連携を許可した場合には、その許可の際にご同意いただいた内容に基づき、以下の情報を当該外部サービスから収集します。
      </p>
      <ul>
        <li>当該外部サービスでユーザーが利用するID</li>
        <li>その他当該外部サービスのプライバシー設定によりユーザーが連携先に開示を認めた情報</li>
      </ul>
      <h4>(3) ユーザーが本サービスを利用するにあたって、私が収集する情報</h4>
      <p>
        私は、本サービスへのアクセス状況やそのご利用方法に関する情報を収集することがあります。これには以下の情報が含まれます。
      </p>
      <ul>
        <li>ログ情報</li>
        <li>Cookie及び匿名ID</li>
      </ul>
      <h3>2. 利用目的</h3>
      <p>2-1 利用者情報は、2-2に定めるとおり本サービスの提供のために利用されます。</p>
      <p>2-2 本サービスのサービス提供にかかわる利用者情報の具体的な利用目的は以下のとおりです。 </p>
      <ol>
        <li>
          本サービスに関する登録の受付、本人確認、利用料金の計算等本サービスの提供、維持、保護及び改善のため
        </li>
        <li>本サービスに関するご案内、お問い合せ等への対応のため</li>
        <li>
          本サービスに関する規約、ポリシー等（以下「規約等」といいます。）に違反する行為に対する対応のため
        </li>
        <li>本サービスに関する規約等の変更などを通知するため</li>
        <li>上記の利用目的に付随する利用目的のため</li>
      </ol>
      <h3>3. 第三者提供</h3>
      <p>
        私は、利用者情報のうち、個人情報については、個人情報保護法その他の法令に基づき開示が認められる場合を除くほか、あらかじめユーザーの同意を得ないで、第三者に提供しません。但し、次に掲げる場合はこの限りではありません。
      </p>
      <ol>
        <li>
          私が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合
        </li>
        <li>合併その他の事由による事業の承継に伴って個人情報が提供される場合</li>
        <li>第4項の定めに従って、情報収集モジュール提供者へ個人情報が提供される場合</li>
        <li>
          国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ユーザーの同意を得ることによって当該事務の遂行に支障を及ぼすおそれがある場合
        </li>
        <li>その他、個人情報保護法その他の法令で認められる場合</li>
      </ol>
      <h3>4. 個人情報の開示</h3>
      <p>
        私は、ユーザーから、個人情報保護法の定めに基づき個人情報の開示を求められたときは、ユーザーご本人からのご請求であることを確認の上で、ユーザーに対し、遅滞なく開示を行います（当該個人情報が存在しないときにはその旨を通知いたします。）。但し、個人情報保護法その他の法令により、私が開示の義務を負わない場合は、この限りではありません。なお、個人情報の開示につきましては、手数料（1件あたり1,000円）を頂戴しておりますので、あらかじめ御了承ください。
      </p>
      <h3>5. 個人情報の訂正及び利用停止等</h3>
      <p>
        5-1 私は、ユーザーから、 (1)
        個人情報が真実でないという理由によって個人情報保護法の定めに基づきその内容の訂正を求められた場合、及び
        (2)
        あらかじめ公表された利用目的の範囲を超えて取り扱われているという理由または偽りその他不正の手段により収集されたものであるという理由により、個人情報保護法の定めに基づきその利用の停止を求められた場合には、ユーザーご本人からのご請求であることを確認の上で遅滞なく必要な調査を行い、その結果に基づき、個人情報の内容の訂正または利用停止を行い、その旨をユーザーに通知します。なお、合理的な理由に基づいて訂正または利用停止を行わない旨の決定をしたときは、ユーザーに対しその旨を通知いたします。
      </p>
      <p>
        5-2
        私は、ユーザーから、ユーザーの個人情報について消去を求められた場合、私が当該請求に応じる必要があると判断した場合は、ユーザーご本人からのご請求であることを確認の上で、個人情報の消去を行い、その旨をユーザーに通知します。
      </p>
      <p>
        5-3
        個人情報保護法その他の法令により、私が訂正等または利用停止等の義務を負わない場合は、前2項の規定は適用されません。
      </p>
      <h3>6. お問い合わせ窓口</h3>
      <p>
        ご意見、ご質問、苦情のお申出その他利用者情報の取扱いに関するお問い合わせは、下記の窓口までお願い致します。
      </p>
      <p>メールアドレス: kaido@odiak.net</p>
    </>
  )
}
